FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/ОстаткиТоваровКомпании/Ext/RecordSetModule.bsl
Перем РежимПроведения Экспорт;		// Режим проведения документа оперативный/неоперативный

Перем ДокументОбъект Экспорт;				//Документ, осуществляющий движение по регистру
Перем РезультатЗапросаПоТоварам Экспорт;	//Выборка табличной части или таблица значений табличной части товаров
Перем СкладКомпании Экспорт;				//Ссылка на склад компании, на котором необходимо производить приходование и резервирование. Если значение неопределено склад находится в табличной части товаров
Перем ГраницаРасчетаОстатков Экспорт;		// Граница расчета остатков
Перем ПоБазовомуКоличеству Экспорт;			// Булево. Ложь - количество товаров будет раcсчитываться как "Количество*Коэффициент", Истина - количество будет браться из реквизита "КоличествоБазовое"
Перем Пересортица Экспорт;					// Булево. Истина - проведение документа Пересортица

// розница
Перем ДвиженияПоРознице Экспорт;			// Булево. Истина - необходимо сделать движения по рознице
Перем ИмяРеквизитаЦенаРозничная Экспорт;	// Строка. Имя реквизита, в котором храниться розничная цена
Перем ИмяРеквизитаСуммаРозничная Экспорт;	// Строка. Имя реквизита, в котором храниться розничная сумма
Перем ЕстьРозничнаяСумма Экспорт;			// Булево. Истина - в таблице товаров указана сумма розницы и все движения надо делать по ней. Ложь - все движения идут в расчете из цены розн.
Перем ЕстьСуммаСкидки Экспорт;				// Булево. Истина - в таблице товаров указана сумма скидки.
Перем СписыватьРозницуПоОстаткам Экспорт;	// Булево. Истина - розничная сумма списывается из расчета остатков
Перем Контрагент Экспорт;					// Для розничных точек

//В соответствии с этими флагами используются соответствующие колонки таблицы товаров
Перем Приходовать	Экспорт; // Булево. Истина - надо приходовать товары на склад
Перем Резервировать	Экспорт; // Булево. Истина - надо резервировать товар на складе

Перем РазрешитьПереоценку Экспорт;          // Булево. Ложь - переоценка запрещена в любом случае

Перем ДеревоОстатковТоваров,ТаблицаРучныхХарактеристик; // что бы по 2 раза не получить в переоценке

// выполняет проверку возможности проведения документа. Истина - ошибок нет. Ложь - есть.
Функция МожноПроводить(ДеревоОстатковТоваров_, ТаблицаТоваров, ТаблицаРучныхХарактеристик, ПолучитьРезерв)
	
	ВсеОК = Истина;
	Права = ДокументОбъект.Права;
	ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ДокументОбъект).Имя;
	//Перебираем строки товаров
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		//Получим склад для резервирования
		Склад = ?(СкладКомпании = Неопределено, СтрокаТоваров.СкладКомпании, СкладКомпании);
		
		Если ТипЗнч(Склад) <> Тип("СправочникСсылка.СкладыКомпании") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Приходовать Тогда
			Количество = Окр(СтрокаТоваров.Количество, 3);
		Иначе 
			Количество = 0;
		КонецЕсли;
		
		Если Резервировать Тогда
			Резерв = СтрокаТоваров.Резерв;
		Иначе
			Резерв = 0;
		КонецЕсли;
		
		//Получим остатки по текущей номенклатуре
		КоличествоОстаток = 0;
		РезервОстаток     = 0;
		КоличествоОсталосьРаспределить = Количество;
		РезервОсталосьРаспределить     = Резерв;
		СтрокаОстатковНоменклатуры = ДеревоОстатковТоваров_.Строки.Найти(СтрокаТоваров.Номенклатура, "Номенклатура");
		Если СтрокаОстатковНоменклатуры<>Неопределено Тогда
			СтруктураОтбораОстатковТоваров=Новый Структура("СкладКомпании");
			СтруктураОтбораОстатковТоваров.СкладКомпании=Склад;
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТоваров.Номенклатура,"Номенклатура")<>Неопределено) Тогда 
				СтруктураОтбораОстатковТоваров.Вставить("ХарактеристикаНоменклатуры",СтрокаТоваров.ХарактеристикаНоменклатуры);
			КонецЕсли;
			МассивНайденныхСтрок=СтрокаОстатковНоменклатуры.Строки.НайтиСтроки(СтруктураОтбораОстатковТоваров);
			Для Каждого ТекСтрока ИЗ МассивНайденныхСтрок Цикл
				
				Если Приходовать Тогда
					Если КоличествоОсталосьРаспределить <= 0 Тогда
						Прервать;
					КонецЕсли;
				ИначеЕсли Резервировать Тогда
					Если РезервОсталосьРаспределить <= 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				РезервОстаток = РезервОстаток + ТекСтрока.Резерв;
				
				Если Приходовать Тогда
					// уменьшим количество остатка
					ВозможноСписать = (ТекСтрока.Количество) - (ТекСтрока.Резерв - Мин(РезервОсталосьРаспределить, ТекСтрока.Резерв));
					КоличествоОстаток = КоличествоОстаток + ВозможноСписать;
					КоличествоКСписанию = Мин(ВозможноСписать, КоличествоОсталосьРаспределить);
					
					Если ТекСтрока.Количество>КоличествоКСписанию Тогда
						ТекСтрока.Количество = ТекСтрока.Количество - КоличествоКСписанию;
						Если ПолучитьРезерв ИЛИ (НЕ Резервировать) Тогда
							СвободныйОстаток = ТекСтрока.Количество - ТекСтрока.Резерв;
							Если КоличествоОсталосьРаспределить > СвободныйОстаток Тогда
								ТекСтрока.Резерв = ТекСтрока.Резерв - Мин(КоличествоОсталосьРаспределить-СвободныйОстаток, ТекСтрока.Резерв);
							КонецЕсли;
						Иначе
							ТекСтрока.Резерв = ТекСтрока.Резерв - РезервОсталосьРаспределить;
						КонецЕсли;
						РезервОсталосьРаспределить = 0;
					Иначе
						РезервОсталосьРаспределить = РезервОсталосьРаспределить - ТекСтрока.Резерв;
						СтрокаОстатковНоменклатуры.Строки.Удалить(ТекСтрока);
					КонецЕсли;
					КоличествоОсталосьРаспределить = КоличествоОсталосьРаспределить - КоличествоКСписанию;
				ИначеЕсли Резервировать Тогда
					// уменьшим количество резерва
					Если ТекСтрока.Резерв>РезервОсталосьРаспределить Тогда
						ТекСтрока.Резерв = ТекСтрока.Резерв - РезервОсталосьРаспределить;
						РезервОсталосьРаспределить = 0;
					Иначе
						РезервОсталосьРаспределить = РезервОсталосьРаспределить - ТекСтрока.Резерв;
						СтрокаОстатковНоменклатуры.Строки.Удалить(ТекСтрока);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПолучитьРезерв Тогда
				Если Количество > КоличествоОстаток Тогда
					Резерв = Мин(Количество-КоличествоОстаток, РезервОстаток);
				КонецЕсли;
				СтрокаТоваров.Резерв = Резерв;
			КонецЕсли;
			
			// Удалим ненужную строку
			Если СтрокаОстатковНоменклатуры.Строки.Количество() = 0 Тогда
				ДеревоОстатковТоваров_.Строки.Удалить(СтрокаОстатковНоменклатуры);
			КонецЕсли;
			
		КонецЕсли;
		
		Если (Приходовать ИЛИ Резервировать) Тогда
			
			Если Приходовать Тогда
				//Если осуществляется расход по складу
				Если Количество>КоличествоОстаток Тогда
					//Расход по складу превышает остаток
					Если обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
						дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""". Остаток "+Формат(КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Списывается "+Формат(Количество,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Превышение "+Формат(Количество-КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
					Иначе
						дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Остаток "+Формат(КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Списывается "+Формат(Количество,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Превышение "+Формат(Количество-КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
					КонецЕсли;
					ВсеОК=Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если Резервировать Тогда
				Если Резерв>РезервОстаток Тогда
					Если обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
						дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""". Зарезервировано "+Формат(РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Снимается с резерва "+Формат(Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Превышение "+Формат(Резерв-РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
					Иначе
						дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Зарезервировано "+Формат(РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Снимается с резерва "+Формат(Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Превышение "+Формат(Резерв-РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
					КонецЕсли; 
					ВсеОК=Ложь;
				КонецЕсли; 
			КонецЕсли;
		Иначе
			//Если осуществляется расход по складу
			Если Количество>КоличествоОстаток Тогда
				//Расход по складу превышает остаток
				Если обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
					дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""". Остаток "+Формат(КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Списывается "+Формат(Количество,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Превышение "+Формат(Количество-КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				Иначе
					дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Остаток "+Формат(КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Списывается "+Формат(Количество,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения)+". Превышение "+Формат(Количество-КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				КонецЕсли; 
				ВсеОК=Ложь;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеОК;
КонецФункции // МожноПроводить()

// Возвращает результат запроса по таблице товаров
Функция ПолучитьТаблицуТоваров()
	// получим результат запроса по товарной таблице
	ПоБазовомуКоличеству=?(ПоБазовомуКоличеству=Неопределено,Ложь,ПоБазовомуКоличеству);
	ИмяРеквизитаЦенаРозничная=?(ИмяРеквизитаЦенаРозничная=Неопределено,"ЦенаРозничная",ИмяРеквизитаЦенаРозничная);
	ИмяРеквизитаСуммаРозничная=?(ИмяРеквизитаСуммаРозничная=Неопределено,"СуммаРозничная",ИмяРеквизитаСуммаРозничная);
	ЕстьСуммаСкидки=?(ЕстьСуммаСкидки=Неопределено,Ложь,ЕстьСуммаСкидки);
    ВидДок=ДокументОбъект.Метаданные().Имя; 
	//Тарабанов
	//Попытка
	//	Если ДокументОбъект.Товары.Выгрузить().Колонки.Найти("Ячейка") <> Неопределено Тогда
	//		ЗначениеДопЗапроса = "
	//		|	ДокументТовары.Ячейка КАК Ячейка,";
	//		ЗначениеДопЗапроса2 = ",
	//		|	ДокументТовары.Ячейка";
	//	Иначе
	//		ЗначениеДопЗапроса = "";
	//		ЗначениеДопЗапроса2 = "";
	//	КонецЕсли;
	//Исключение
	//	ЗначениеДопЗапроса = "";
	//	ЗначениеДопЗапроса2 = "";
	//КонецПопытки;
	//Тарабанов
	
	
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	"+?(СкладКомпании=Неопределено,"ДокументТовары.МестоРазмещения","&СкладКомпании")+" КАК СкладКомпании,
	|	МАКСИМУМ("+?(ДвиженияПоРознице,"ДокументТовары."+ИмяРеквизитаЦенаРозничная,"0")+") КАК ЦенаРозничная,
	|   МАКСИМУМ("+?(ДвиженияПоРознице,"ДокументТовары."+ИмяРеквизитаСуммаРозничная,"0")+") КАК СуммаРозничная,
	|   МАКСИМУМ("+?(ЕстьСуммаСкидки,"ДокументТовары.СуммаСкидки","0")+") КАК СуммаСкидки
	|";
	Если Приходовать Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА("+?(ПоБазовомуКоличеству,"ДокументТовары.КоличествоБазовое","ДокументТовары.Количество*ДокументТовары.Коэффициент")+") КАК Количество
		|";
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(0) КАК Количество
		|";
	КонецЕсли; 
	Если Резервировать Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(ДокументТовары.Резерв*ДокументТовары.Коэффициент) КАК Резерв
		|";
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(0) КАК Резерв
		|";
	КонецЕсли;
	ТекстЗапроса=ТекстЗапроса+"
	|ИЗ
	|	Документ."+ВидДок+".Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка И ДокументТовары.Номенклатура.ВидНоменклатуры<>&Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры"+?(СкладКомпании = Неопределено, ",
	|	ДокументТовары.МестоРазмещения","")+"
	|";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);

	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьТаблицуТоваров()

// Возвращает дерево значений по остаткам товаров и резервам
Функция ПолучитьДеревоОстатков()
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток,0) КАК Количество,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток,0) КАК Резерв,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток,0) КАК СуммаРозн
	|ИЗ 
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&Момент,Номенклатура В (&Номенклатура)"+?(СкладКомпании<>Неопределено," И СкладКомпании=&СкладКомпании","")+") КАК ОстаткиТоваровКомпанииОстатки
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиТоваровКомпании.Остатки
	|
	|УПОРЯДОЧИТЬ ПО 
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.Сортировка Возр
	|
	|ИТОГИ СУММА(Количество) КАК Количество, СУММА(Резерв) КАК Резерв, СУММА(СуммаРозн) КАК СуммаРозн
	|ПО Номенклатура
	|";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Момент",?(ГраницаРасчетаОстатков=Неопределено,?(РежимПроведения=РежимПроведенияДокумента.Оперативный,Неопределено,ДокументОбъект.МоментВремени()),ГраницаРасчетаОстатков));
	Запрос.УстановитьПараметр("Номенклатура",РезультатЗапросаПоТоварам.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	
	// Наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ОстаткиТоваровКомпании");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период", Новый Диапазон(, ДокументОбъект.Дата)); 
	Если СкладКомпании<>Неопределено Тогда
		ЗначенияБлокировки.Вставить("СкладКомпании", СкладКомпании); 
	КонецЕсли;
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", РезультатЗапросаПоТоварам);
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Номенклатура", "Номенклатура");
	//обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции // ПолучитьДеревоОстатков()

// Переоценивает учетную розничную стоимость склада
Функция Переоценка(ХозОперация,СбрасыватьПеременные=Истина,ПереоценитьВсе=Истина) Экспорт
	ДвиженияПоРознице=?(ДвиженияПоРознице=Неопределено,Ложь,ДвиженияПоРознице);
	// получим таблицу товарного состава
	Если (РезультатЗапросаПоТоварам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваров();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	ТаблицаТоваров=РезультатЗапросаПоТоварам;
	// если нет остатков, то получим их
	Если ДеревоОстатковТоваров=Неопределено Тогда
		ДеревоОстатковТоваров=ПолучитьДеревоОстатков();
	КонецЕсли;
	
	// упорядочим по нормальному
	ТаблицаТоваров.Сортировать("Номенклатура Возр,ХарактеристикаНоменклатуры Убыв");
	
	// получим таблицу номенклатуры с ручным списанием характеристик
	Если ТаблицаРучныхХарактеристик=Неопределено Тогда
		ТаблицаРучныхХарактеристик=дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(ДокументОбъект.Ссылка);
	КонецЕсли;
		
	// переоцениваем
	Для Каждого СтрокаТовар Из ТаблицаТоваров Цикл
		Склад=?(СкладКомпании=Неопределено,СтрокаТовар.СкладКомпании,СкладКомпании);
		
		СтрокаОстатковНоменклатуры=ДеревоОстатковТоваров.Строки.Найти(СтрокаТовар.Номенклатура,"Номенклатура");
		Если СтрокаОстатковНоменклатуры=Неопределено Тогда Продолжить; КонецЕсли;
		
		// определяем фильтр
		СтруктураОтбора=Новый Структура("Номенклатура");
		СтруктураОтбора.Номенклатура=СтрокаТовар.Номенклатура; 
		Если НЕ обЗначениеНеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТовар.Номенклатура,"Номенклатура")<>Неопределено) Тогда 
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТовар.ХарактеристикаНоменклатуры);
		КонецЕсли;
		СтруктураОтбора.Вставить("СкладКомпании",Склад);
		
		НадоПереоценить=СтрокаТовар.Количество;
		МассивНайденныхСтрок=СтрокаОстатковНоменклатуры.Строки.НайтиСтроки(СтруктураОтбора);
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			ТекСтрока=МассивНайденныхСтрок[Сч];
			// расчет суммы переоценки
			НадоПереоценить=?(СтрокаТовар.Количество=0 ИЛИ ПереоценитьВсе,ТекСтрока.Количество,НадоПереоценить);
			СуммаПереоценки=СтрокаТовар.ЦенаРозничная*Мин(НадоПереоценить,ТекСтрока.Количество);
			СуммаПереоценки=СуммаПереоценки-?(ТекСтрока.Количество=0,0,(ТекСтрока.СуммаРозн/ТекСтрока.Количество)*Мин(НадоПереоценить,ТекСтрока.Количество));
			// если нечего переоценивать, то выходим
			Если Окр(СуммаПереоценки,2)=0 Тогда Продолжить; Конецесли;
			//
			
			НоваяЗапись=Добавить();
			НоваяЗапись.ВидДвижения=?(СуммаПереоценки>0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			НоваяЗапись.Период=ДокументОбъект.Дата;
			НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
			НоваяЗапись.СкладКомпании=Склад;
			НоваяЗапись.Номенклатура=СтрокаТовар.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры=ТекСтрока.ХарактеристикаНоменклатуры;
			// ресурсы
			НоваяЗапись.Резерв=0;
			НоваяЗапись.Количество=0;
			НоваяЗапись.СуммаРозн=Окр(?(СуммаПереоценки>0,СуммаПереоценки,-СуммаПереоценки),2);
			// реквизиты
			НоваяЗапись.ХозОперация=ХозОперация;
			НоваяЗапись.Цена=СтрокаТовар.ЦенаРозничная;
			НоваяЗапись.КоличествоПереоценки=Мин(НадоПереоценить,ТекСтрока.Количество);

			НадоПереоценить=НадоПереоценить-Мин(НадоПереоценить,ТекСтрока.Количество);
			
			Если СтрокаТовар.Количество<>0 И НЕ ПереоценитьВсе Тогда
				Если НадоПереоценить=0 Тогда Прервать; КонецЕсли;
			КонецЕсли;
			
		КонецЦикла
	КонецЦикла;

	Если СбрасыватьПеременные Тогда
		РезультатЗапросаПоТоварам=Неопределено;
		ДеревоОстатковТоваров=Неопределено;
		ДокументОбъект=Неопределено;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции // Переоценка()

// Формирует движения по регистру приход (увеличение товарного запаса)
// Возвращаемое значение: Булево. Истина - все окей, Ложь - чего-то не так.
Функция Приход() Экспорт
	ВсеОК=Истина;
	ЕстьРозничнаяСумма=?(ЕстьРозничнаяСумма=Неопределено,Ложь,ЕстьРозничнаяСумма);
	ДвиженияПоРознице=?(ДвиженияПоРознице=Неопределено,Ложь,ДвиженияПоРознице);
	РазрешитьПереоценку = ?(РазрешитьПереоценку=Неопределено,Истина,РазрешитьПереоценку);
	
	// получим таблицу товарного состава
	Если (РезультатЗапросаПоТоварам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваров();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	//Получение остатков на складе
	ДеревоОстатковТоваров=ПолучитьДеревоОстатков();
	
	// переоценка
	Если РазрешитьПереоценку И ДвиженияПоРознице И ДокументОбъект.ПодразделениеКомпании.ПереоценкаРозницаПоПриходу И НЕ ЕстьРозничнаяСумма Тогда
		ВсеОК = Переоценка(Справочники.ХозОперации.ПереоценкаРозницаПоПриходу,Ложь);
	КонецЕсли;
	
	// создадим структуру отбора
	СтруктураОтбораОстатковТоваров=Новый Структура("ХарактеристикаНоменклатуры,СкладКомпании");
    
    Права=ДокументОбъект.Права;
    ИмяКолонкиКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ДокументОбъект).Имя;
	//Перебираем строки товаров
	НомерСтроки = 0;
	Для каждого СтрокаТоваров Из РезультатЗапросаПоТоварам Цикл
		НомерСтроки = НомерСтроки + 1;
		//Получим склад для резервирования
		Склад=?(СкладКомпании=Неопределено,СтрокаТоваров.СкладКомпании,СкладКомпании);
		Если ТипЗнч(Склад)=Тип("СправочникСсылка.СкладыКомпании") Тогда
			Если Резервировать Тогда Резерв=СтрокаТоваров.Резерв; Иначе Резерв=0; КонецЕсли;
		Иначе
			Резерв=0;
		КонецЕсли; 
		Если Приходовать Тогда Количество=СтрокаТоваров.Количество; Иначе Количество=0; КонецЕсли;
		
		//Получим остатки по текущей номенклатуре
		КоличествоОстаток=0; РезервОстаток=0;
		СтрокаОстатковНоменклатуры=ДеревоОстатковТоваров.Строки.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
		Если СтрокаОстатковНоменклатуры<>Неопределено Тогда
			СтруктураОтбораОстатковТоваров.ХарактеристикаНоменклатуры=СтрокаТоваров.ХарактеристикаНоменклатуры;
			СтруктураОтбораОстатковТоваров.СкладКомпании=Склад;
			МассивНайденныхСтрок=СтрокаОстатковНоменклатуры.Строки.НайтиСтроки(СтруктураОтбораОстатковТоваров);
			Если МассивНайденныхСтрок.Количество()>0 Тогда
				ТекСтрока=МассивНайденныхСтрок[0];
				КоличествоОстаток=ТекСтрока.Количество-ТекСтрока.Резерв;
				РезервОстаток=ТекСтрока.Резерв;
			КонецЕсли;
		КонецЕсли;
		
		Если Резервировать 
			//И РежимПроведения=РежимПроведенияДокумента.Оперативный 
			Тогда
			Если (Резерв<0) И ((-Резерв)>(РезервОстаток)) Тогда
				//Если осуществляется снятие резерва, снятие резерва не должно превышать остаток резерва
				Если обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
					дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""". Остаток резерва "+Формат(РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Снимается с резерва "+Формат(-Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+Формат((-Резерв)-РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				Иначе
					дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Остаток резерва "+Формат(РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Снимается с резерва "+Формат(-Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+Формат((-Резерв)-РезервОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				КонецЕсли; 
				ВсеОК=Ложь;
			КонецЕсли; 
			Если (Резерв>0) И (Резерв>(КоличествоОстаток+Количество)) Тогда
				//Если осуществляется резервирование больше остатка на складе
				Если обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
					дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""". Остаток на складе "+Формат(КоличествоОстаток+Количество,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Резервируется "+Формат(Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+Формат(Резерв-(КоличествоОстаток+Количество),"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				Иначе
					дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Остаток на складе "+Формат(КоличествоОстаток+Количество,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Резервируется "+Формат(Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+Формат(Резерв-(КоличествоОстаток+Количество),"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				КонецЕсли; 
				ВсеОК=Ложь;
			КонецЕсли; 
		КонецЕсли;
		Если ВсеОК И (Количество<>0 ИЛИ Резерв<>0) Тогда
			// Создаем запись регистра заказов покупателей
			НоваяЗапись=Добавить();
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период=ДокументОбъект.Дата;
			НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
			НоваяЗапись.СкладКомпании=Склад;
			НоваяЗапись.Номенклатура=СтрокаТоваров.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры=СтрокаТоваров.ХарактеристикаНоменклатуры;
			НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
			НоваяЗапись.Контрагент=Контрагент;
						
			// количество
            НоваяЗапись.Резерв=Резерв;
			НоваяЗапись.Количество=Количество;
			Если ДвиженияПоРознице Тогда
				НоваяЗапись.СуммаРозн=?(ЕстьРозничнаяСумма,СтрокаТоваров.СуммаРозничная,СтрокаТоваров.ЦенаРозничная*Количество);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	ДеревоОстатковТоваров=Неопределено;
	РезультатЗапросаПоТоварам=Неопределено;
	ТаблицаРучныхХарактеристик=Неопределено;
	
	Возврат ВсеОК;
КонецФункции // Приход()

// Формирует движения по регистру расход (уменьшение товарного запаса)
// Возвращаемое значение: Булево. Истина - все окей, Ложь - чего-то не так.
Функция Расход() Экспорт
	ЕстьРозничнаяСумма=?(ЕстьРозничнаяСумма=Неопределено,Ложь,ЕстьРозничнаяСумма);
	ДвиженияПоРознице=?(ДвиженияПоРознице=Неопределено,Ложь,ДвиженияПоРознице);
	СписыватьРозницуПоОстаткам=?(СписыватьРозницуПоОстаткам=Неопределено,Ложь,СписыватьРозницуПоОстаткам);
	РазрешитьПереоценку = ?(РазрешитьПереоценку=Неопределено,Истина,РазрешитьПереоценку);
	
	ОтрицательныеОстаткиРазрешены = (обПраво("РазрешитьОтрицательныеСкладскиеОстатки",ДокументОбъект.Права,,ДокументОбъект)=Перечисления.ВидыРазрешенныхОтрицательныхОстатков.ПоОстаткам);
	Если ОтрицательныеОстаткиРазрешены Тогда
		ВыводитьКритическиеСообщения = обПраво("ВыводитьСообщенияПроверкиПравДоступа",ДокументОбъект.Права,,ДокументОбъект);
	Иначе
		ВыводитьКритическиеСообщения = Ложь;
	КонецЕсли;
	
	// получим таблицу товарного состава
	Если (РезультатЗапросаПоТоварам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваров();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	
	//Тарабанов
	//Проверяем остатки на складах
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//Попытка
	//	Для каждого СТр Из РезультатЗапросаПоТоварам Цикл
	//		Склад = ?(СкладКомпании=Неопределено, СТр.СкладКомпании, СкладКомпании);
	//		попытка 
	//			проверяемоезначение = стр.количество;
	//		исключение
	//			проверяемоезначение = стр.резерв;
	//		конецпопытки;

	//		Если Склад.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
	//			Если проверяемоезначение > ОстатокТовараНаЯчейке(Стр.Номенклатура, Стр.Ячейка, Склад) Тогда
	//				Если НЕ РольДоступна(Метаданные.Роли.ВосстПослед) Тогда
	//					дкСообщитьРезультат("Превышен остаток по позиции " + Стр.Номенклатура + " по ячейке " + Стр.Ячейка,,ДокументОбъект,Стр.Номенклатура);
	//					Возврат Ложь;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//Исключение
	//	дкСообщитьРезультат("ОШИБКА!!!! Не возможно проверить остатки по ячейка",,ДокументОбъект,);
	//	Возврат Ложь;
	//КонецПопытки;
	//
	

	//Тарабанов
	
	// упорядочим по нормальному
	РезультатЗапросаПоТоварам.Сортировать("Номенклатура Возр,ХарактеристикаНоменклатуры Убыв");
	
	//Получение остатков на складе
	ДеревоОстатковТоваров=ПолучитьДеревоОстатков();
	Если Не Пересортица Тогда
		// получим таблицу номенклатуры с ручным списанием характеристик
		ТаблицаРучныхХарактеристик=дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(ДокументОбъект.Ссылка);
	КонецЕсли;
	
	ПолучитьРезерв = Ложь;
	Если РезультатЗапросаПоТоварам.Колонки.Найти("Резерв") = Неопределено Тогда
		РезультатЗапросаПоТоварам.Колонки.Добавить("Резерв", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
		ПолучитьРезерв = Резервировать;
	КонецЕсли;
	
	// проверим сначала возможность проведения
	Если НЕ ОтрицательныеОстаткиРазрешены И НЕ МожноПроводить(ДеревоОстатковТоваров.Скопировать(),РезультатЗапросаПоТоварам,ТаблицаРучныхХарактеристик, ПолучитьРезерв) Тогда
		РезультатЗапросаПоТоварам=Неопределено;
		ДокументОбъект=Неопределено;
		ДеревоОстатковТоваров=Неопределено;
		ТаблицаРучныхХарактеристик=Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	// переоценка
	ПереоценкаРозницаПоРасходу=ДокументОбъект.ПодразделениеКомпании.ПереоценкаРозницаПоРасходу;
	Если РазрешитьПереоценку И ДвиженияПоРознице И ПереоценкаРозницаПоРасходу И НЕ ЕстьРозничнаяСумма Тогда
		ВсеОК = Переоценка(Справочники.ХозОперации.ПереоценкаРозницаПоРасходу,Ложь,Ложь);
	КонецЕсли;
	
	//Перебираем строки товаров
	НомерСтроки = 0;
	Для Каждого СтрокаТоваров Из РезультатЗапросаПоТоварам Цикл
		НомерСтрки = НомерСтроки + 1;
		//Получим склад для резервирования
		Склад = ?(СкладКомпании=Неопределено, СтрокаТоваров.СкладКомпании, СкладКомпании);
		Если ТипЗнч(Склад)<>Тип("СправочникСсылка.СкладыКомпании") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Приходовать Тогда
			Количество = СтрокаТоваров.Количество;
		Иначе
			Количество=0;
		КонецЕсли;
		
		Резерв = СтрокаТоваров.Резерв;
		НадоСписатьКоличество = Окр(Количество, 3);
		НадоСписатьРезерв     = Окр(Резерв, 3);
		Попытка
			НадоСписатьСкидка = СтрокаТоваров.СуммаСкидки;
		Исключение
			НадоСписатьСкидка=0;
		КонецПопытки;
		
		флСторно = ?(НадоСписатьКоличество>0, ЛОЖЬ, ИСТИНА);
		
		//Получим остатки по текущей номенклатуре
		СтрокаОстатковНоменклатуры=ДеревоОстатковТоваров.Строки.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
		Если СтрокаОстатковНоменклатуры<>Неопределено Тогда
			СтруктураОтбораОстатковТоваров = Новый Структура("СкладКомпании");
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТоваров.Номенклатура,"Номенклатура")<>Неопределено) Тогда 
				СтруктураОтбораОстатковТоваров.Вставить("ХарактеристикаНоменклатуры",СтрокаТоваров.ХарактеристикаНоменклатуры);
			КонецЕсли;
			СтруктураОтбораОстатковТоваров.СкладКомпании = Склад;
			МассивНайденныхСтрок = СтрокаОстатковНоменклатуры.Строки.НайтиСтроки(СтруктураОтбораОстатковТоваров);
			
			Если Количество<>0 ИЛИ Резерв<>0 Тогда
				// списание в разрезе характеристик
				Для Каждого СтрокаОстатки ИЗ МассивНайденныхСтрок Цикл
					
					Если СтрокаОстатки.Количество<=0 Тогда
						Продолжить;
					КонецЕсли;
					
					// Списываем товар
					НоваяЗапись=Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
					НоваяЗапись.Период        = ДокументОбъект.Дата;
					НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
					НоваяЗапись.СкладКомпании = Склад;
					НоваяЗапись.Номенклатура  = СтрокаТоваров.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = СтрокаОстатки.ХарактеристикаНоменклатуры;
					НоваяЗапись.Контрагент    = Контрагент;
					//+Тарабанов
			////Создаем движение по ячейкам
			//Если Склад.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
			//	Попытка
			//		НоваяЗапись.Ячейка = СтрокаТоваров.Ячейка;
			//	Исключение
			//		дкСообщитьРезультат("Строка " + НомерСтроки + " Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Не указана ячейка." ,"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
			//		ВсеОК=Ложь;
			//	КонецПопытки;
			//КонецЕсли;
			//-Тарабанов

					// определяемся с хоз. операцией
					НоваяЗапись.ХозОперация   = ДокументОбъект.ХозОперация;
					// количество
					НоваяЗапись.Количество    = Мин(СтрокаОстатки.Количество,НадоСписатьКоличество);
					НоваяЗапись.Резерв        = Мин(СтрокаОстатки.Резерв,НадоСписатьРезерв);
					// розничная сумма
					Если ДвиженияПоРознице Тогда
						Если ЕстьРозничнаяСумма И НЕ СписыватьРозницуПоОстаткам Тогда
							НоваяЗапись.СуммаРозн = Окр(СтрокаТоваров.СуммаРозничная,2);
						ИначеЕсли ПереоценкаРозницаПоРасходу И НЕ СписыватьРозницуПоОстаткам Тогда
							НоваяЗапись.СуммаРозн = Окр(СтрокаТоваров.ЦенаРозничная*Количество,2);
						Иначе
							НоваяЗапись.СуммаРозн = Окр(?(СтрокаОстатки.Количество<=НадоСписатьКоличество,СтрокаОстатки.СуммаРозн,СтрокаОстатки.СуммаРозн/СтрокаОстатки.Количество*НадоСписатьКоличество),2);
						КонецЕсли;
					КонецЕсли;
				
					// скидка
					Если НадоСписатьСкидка>0 Тогда
						НоваяЗапись.СуммаСкидки=Окр(?(СтрокаОстатки.Количество>=НадоСписатьКоличество,НадоСписатьСкидка,НадоСписатьКоличество/СтрокаТоваров.Количество*НадоСписатьСкидка),2);
						НадоСписатьСкидка=НадоСписатьСкидка-НоваяЗапись.СуммаСкидки;
					КонецЕсли;
					
					// если списали все с этой характеристикой, то удалим данную строку.
					// если нет, то уменьшим количество остатка
					Если СтрокаОстатки.Количество>НоваяЗапись.Количество Тогда
						СтрокаОстатки.Количество = СтрокаОстатки.Количество - НоваяЗапись.Количество;
						СтрокаОстатки.Резерв     = СтрокаОстатки.Резерв - НоваяЗапись.Резерв;
					Иначе
						СтрокаОстатковНоменклатуры.Строки.Удалить(СтрокаОстатки);
					КонецЕсли;
					
					СтрокаОстатковНоменклатуры.Количество = СтрокаОстатковНоменклатуры.Количество - НоваяЗапись.Количество;
					СтрокаОстатковНоменклатуры.Резерв     = СтрокаОстатковНоменклатуры.Резерв - НоваяЗапись.Резерв;
					
					НадоСписатьКоличество = НадоСписатьКоличество - НоваяЗапись.Количество;
					НадоСписатьРезерв     = НадоСписатьРезерв - НоваяЗапись.Резерв;
					Если НадоСписатьКоличество<=0 И НадоСписатьРезерв<=0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				// удалим ненужную строку из дерева
				Если СтрокаОстатковНоменклатуры.Количество<=0 Тогда
					ДеревоОстатковТоваров.Строки.Удалить(СтрокаОстатковНоменклатуры);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		// если после списания осталось еще то, что надо списать, то наверное у нас разрешены отрицательные остатки
		// спишем их
		Если НадоСписатьКоличество>0 ИЛИ НадоСписатьРезерв>0 ИЛИ (флСторно И НадоСписатьКоличество<0) Тогда
			НоваяЗапись=Добавить();
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период=ДокументОбъект.Дата;
			НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
			НоваяЗапись.СкладКомпании=Склад;
			НоваяЗапись.Номенклатура=СтрокаТоваров.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры=СтрокаТоваров.ХарактеристикаНоменклатуры;
			НоваяЗапись.Контрагент=Контрагент;
			НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
			НоваяЗапись.Количество=НадоСписатьКоличество;
			НоваяЗапись.Резерв=НадоСписатьРезерв;
			НоваяЗапись.СуммаСкидки=НадоСписатьСкидка;
			//+Тарабанов
			////Создаем движение по ячейкам
			//Если Склад.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
			//	Попытка
			//		НоваяЗапись.Ячейка = СтрокаТоваров.Ячейка;
			//	Исключение
			//		дкСообщитьРезультат("Строка " + НомерСтроки + " Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Не указана ячейка." ,"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
			//		ВсеОК=Ложь;
			//	КонецПопытки;
			//КонецЕсли;
			//-Тарабанов

			Если ДвиженияПоРознице Тогда
				Если ЕстьРозничнаяСумма Тогда
					СуммаРозничная = СтрокаТоваров.СуммаРозничная;
				Иначе
					СуммаРозничная = СтрокаТоваров.ЦенаРозничная*СтрокаТоваров.Количество;
				КонецЕсли;
				НоваяЗапись.СуммаРозн = Окр((СуммаРозничная/СтрокаТоваров.Количество)*НадоСписатьКоличество,2);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	ДеревоОстатковТоваров=Неопределено;
	РезультатЗапросаПоТоварам=Неопределено;
	ТаблицаРучныхХарактеристик=Неопределено;
	
	// возврат результата
	Возврат Истина;
КонецФункции // Расход()

// Формирует движения по регистру резервирование (увеличение резерва товарного запаса под заказ)
// Возвращаемое значение: Булево. Истина - все окей, Ложь - чего-то не так.
Функция Зарезервировать() Экспорт
	
	ВсеОК         = Истина;
	Резервировать = Истина;
	
	// получим таблицу товарного состава
	Если (РезультатЗапросаПоТоварам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("ТаблицаЗначений")) Тогда
		
		Если ДокументОбъект.Метаданные().Имя = "ЗаявкаНаРемонт" Тогда
			РезультатЗапросаПоТоварам = ПолучитьТаблицуТоваров_ЗаявкаНаРемонт();
		Иначе	
			РезультатЗапросаПоТоварам = ПолучитьТаблицуТоваров();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	
	//Получение остатков на складе
	ДеревоОстатковТоваров = ПолучитьДеревоОстатков();
	
	Права                      = ДокументОбъект.Права;
	ИмяКолонкиКода             = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(, ДокументОбъект).Имя;
	ТаблицаРучныхХарактеристик = дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(ДокументОбъект.Ссылка);
	
	РезультатЗапросаПоТоварам.Сортировать("Номенклатура Возр, ХарактеристикаНоменклатуры Убыв");
	
	//Перебираем строки товаров
	Для Каждого СтрокаТоваров Из РезультатЗапросаПоТоварам Цикл
		//Получим склад для резервирования
		
		//++СнимченкоАА_бизтех++   
		Если ДокументОбъект.Метаданные().Имя = "ЗаявкаНаРемонт" Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТоваров.СкладКомпании) Тогда
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		//--СнимченкоАА_бизтех--
		
		Склад = ?(СкладКомпании=Неопределено, СтрокаТоваров.СкладКомпании, СкладКомпании);
		Если ТипЗнч(Склад) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			Резерв = СтрокаТоваров.Резерв;
		Иначе
			Резерв = 0;
		КонецЕсли;
		
		Если Резерв=0 Тогда
			Продолжить;
		КонецЕсли;
		
		//Получим остатки по текущей номенклатуре
		КоличествоОстаток = 0;
		СтрокаОстатковНоменклатуры = ДеревоОстатковТоваров.Строки.Найти(СтрокаТоваров.Номенклатура, "Номенклатура");
		Если СтрокаОстатковНоменклатуры <> Неопределено Тогда
			
			// Создадим структуру отбора
			СтруктураОтбораОстатковТоваров = Новый Структура("СкладКомпании", Склад);
			
			Если ЗначениеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТоваров.Номенклатура,"Номенклатура")<>Неопределено) Тогда
				СтруктураОтбораОстатковТоваров.Вставить("ХарактеристикаНоменклатуры", СтрокаТоваров.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			МассивНайденныхСтрок = СтрокаОстатковНоменклатуры.Строки.НайтиСтроки(СтруктураОтбораОстатковТоваров);
			Для Каждого ТекСтрока Из МассивНайденныхСтрок Цикл
				
				Если Резерв = 0 Тогда
					Прервать;
				КонецЕсли;
				
				СвободноеКоличество = (ТекСтрока.Количество-ТекСтрока.Резерв);
				
				Если СвободноеКоличество <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				КоличествоКПриходу = Мин(Резерв, СвободноеКоличество);
				
				КоличествоОстаток  = КоличествоОстаток + СвободноеКоличество;
				
				// Создаем запись регистра заказов покупателей
				НоваяЗапись = Добавить();
				НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период                     = ДокументОбъект.Дата;
				НоваяЗапись.Регистратор                = ДокументОбъект.Ссылка;
				НоваяЗапись.СкладКомпании              = Склад;
				НоваяЗапись.Номенклатура               = СтрокаТоваров.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация                = ДокументОбъект.ХозОперация;
				НоваяЗапись.Контрагент                 = Контрагент;
				
				//+Тарабанов
				//Создаем движение по ячейкам
				//Если Склад.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
				//	Попытка
				//		Если ЗначениеЗаполнено(СтрокаТоваров.Ячейка) Тогда
				//			НоваяЗапись.Ячейка = СтрокаТоваров.Ячейка;
				//		Иначе
				//			дкСообщитьРезультат("Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Не указана ячейка." ,"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				//			ВсеОК=Ложь;
				//		КонецЕсли;
				//	Исключение
				//		дкСообщитьРезультат("Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Не указана ячейка." ,"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				//		ВсеОК=Ложь;
				//	КонецПопытки;
				//КонецЕсли;
				//-Тарабанов
				
				// количество
				НоваяЗапись.Резерв                     = КоличествоКПриходу;
				
				Резерв = Резерв - КоличествоКПриходу;
				
			КонецЦикла;
			
		КонецЕсли;
		
		//Если (Резерв>0) И (Резерв>(КоличествоОстаток+Количество)) Тогда
		Если Резерв>0 Тогда
			//Если осуществляется резервирование больше остатка на складе
			Если обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
				дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""". Остаток на складе "+Формат(КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Резервируется "+Формат(СтрокаТоваров.Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+Формат(Резерв, "ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
				
				Если ДокументОбъект.Метаданные().Имя = "ЗаявкаНаРемонт" Тогда  
					Сообщить(СтрШаблон("%1 нет на складе в количестве %2. Резервирование не будет выполнено!",Строка(СтрокаТоваров.Номенклатура),Формат(СтрокаТоваров.Резерв,"ЧДЦ=3; ЧН=0,00")));
				КонецЕсли;     
				
			Иначе
				дкСообщитьРезультат("["+дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,ИмяКолонкиКода,ДокументОбъект,Истина)+"] Товар """+СокрЛП(СтрокаТоваров.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+""". Остаток на складе "+Формат(КоличествоОстаток,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Резервируется "+Формат(СтрокаТоваров.Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Превышение "+Формат(Резерв,"ЧДЦ=3; ЧН=0,00")+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения),"Важное&Остатки товаров компании:",ДокументОбъект,СтрокаТоваров.Номенклатура);
			КонецЕсли; 
			
			ВсеОК = Ложь;    
			
			//++СнимченкоАА_бизтех++
			Если ДокументОбъект.Метаданные().Имя = "ЗаявкаНаРемонт" Тогда
				ВсеОК = Истина;
			КонецЕсли;
			//--СнимченкоАА_бизтех-
			
		КонецЕсли;
		
	КонецЦикла;
	
	// убиваем циклическую ссылку
	ДокументОбъект             = Неопределено;
	ДеревоОстатковТоваров      = Неопределено;
	РезультатЗапросаПоТоварам  = Неопределено;
	ТаблицаРучныхХарактеристик = Неопределено;
	
	Возврат ВсеОК;
	
КонецФункции // Резервирование()

//++СнимченкоАА_бизтех++
Функция ПолучитьТаблицуТоваров_ЗаявкаНаРемонт()
	// получим результат запроса по товарной таблице
	ПоБазовомуКоличеству=?(ПоБазовомуКоличеству=Неопределено,Ложь,ПоБазовомуКоличеству);
	ИмяРеквизитаЦенаРозничная=?(ИмяРеквизитаЦенаРозничная=Неопределено,"ЦенаРозничная",ИмяРеквизитаЦенаРозничная);
	ИмяРеквизитаСуммаРозничная=?(ИмяРеквизитаСуммаРозничная=Неопределено,"СуммаРозничная",ИмяРеквизитаСуммаРозничная);
	ЕстьСуммаСкидки=?(ЕстьСуммаСкидки=Неопределено,Ложь,ЕстьСуммаСкидки);
    ВидДок=ДокументОбъект.Метаданные().Имя; 
	
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	"+?(СкладКомпании=Неопределено,"ДокументТовары.СкладКомпании","&СкладКомпании")+" КАК СкладКомпании,
	|	МАКСИМУМ("+?(ДвиженияПоРознице,"ДокументТовары."+ИмяРеквизитаЦенаРозничная,"0")+") КАК ЦенаРозничная,
	|   МАКСИМУМ("+?(ДвиженияПоРознице,"ДокументТовары."+ИмяРеквизитаСуммаРозничная,"0")+") КАК СуммаРозничная,
	|   МАКСИМУМ("+?(ЕстьСуммаСкидки,"ДокументТовары.СуммаСкидки","0")+") КАК СуммаСкидки
	|";
	Если Приходовать Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА("+?(ПоБазовомуКоличеству,"ДокументТовары.КоличествоБазовое","ДокументТовары.Количество*ДокументТовары.Коэффициент")+") КАК Количество
		|";
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(0) КАК Количество
		|";
	КонецЕсли; 
	Если Резервировать Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(ДокументТовары.Количество*ДокументТовары.Коэффициент) КАК Резерв
		|";
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(0) КАК Резерв
		|";
	КонецЕсли;
	ТекстЗапроса=ТекстЗапроса+"
	|ИЗ
	|	Документ."+ВидДок+".Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка И ДокументТовары.Номенклатура.ВидНоменклатуры<>&Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры"+?(СкладКомпании = Неопределено, ",
	|	ДокументТовары.СкладКомпании","")+"
	|";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);

	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьТаблицуТоваров()
//--СнимченкоАА_бизтех--

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()

Функция ОстатокТовараНаЯчейке(НоменклатураЗ, ЯчейкаЗ, СкладЗ)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И СкладКомпании = &Склад
		|				И Ячейка = &Ячейка) КАК ОстаткиТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураЗ);
	Запрос.УстановитьПараметр("Склад", СкладЗ);
	Запрос.УстановитьПараметр("Ячейка", ЯчейкаЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат 0;
КонецФункции

////////////////////////////////////////////////////////////////////////
//Инициализация переменных модуля набора записей

ДокументОбъект=Неопределено; // !!! Обязательный к заполнению перед началом проведения
РезультатЗапросаПоТоварам=Неопределено;
СкладКомпании=Неопределено;
ГраницаРасчетаОстатков=Неопределено;

Приходовать=Истина;
Резервировать=Ложь;
ПоБазовомуКоличеству=Ложь;
Пересортица = Ложь;
